Step2: Low-Rank(8X Compression) Model Model SummaryModel: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_15 (Dense)             (None, 12)                9420      
_________________________________________________________________
dense_16 (Dense)             (None, 100)               1300      
_________________________________________________________________
dense_17 (Dense)             (None, 6)                 606       
_________________________________________________________________
dense_18 (Dense)             (None, 50)                350       
_________________________________________________________________
dense_19 (Dense)             (None, 10)                510       
_________________________________________________________________
dense_20 (Dense)             (None, 10)                110       
=================================================================
Total params: 12,296
Trainable params: 12,296
Non-trainable params: 0
_________________________________________________________________
