Step2: Low-Rank(4X Compression) Model Model SummaryModel: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_9 (Dense)              (None, 25)                19625     
_________________________________________________________________
dense_10 (Dense)             (None, 100)               2600      
_________________________________________________________________
dense_11 (Dense)             (None, 12)                1212      
_________________________________________________________________
dense_12 (Dense)             (None, 50)                650       
_________________________________________________________________
dense_13 (Dense)             (None, 10)                510       
_________________________________________________________________
dense_14 (Dense)             (None, 10)                110       
=================================================================
Total params: 24,707
Trainable params: 24,707
Non-trainable params: 0
_________________________________________________________________
