VGG16_with_study_labels_only_with_1_hidden_layers Model SummaryModel: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
vgg16 (Functional)           (None, 2, 2, 512)         14714688  
_________________________________________________________________
flatten (Flatten)            (None, 2048)              0         
_________________________________________________________________
dense (Dense)                (None, 16)                32784     
_________________________________________________________________
dense_1 (Dense)              (None, 128)               2176      
_________________________________________________________________
dense_2 (Dense)              (None, 36)                4644      
=================================================================
Total params: 14,754,292
Trainable params: 39,604
Non-trainable params: 14,714,688
_________________________________________________________________
