VGG16_with_1_hidden_layers Model SummaryModel: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
vgg16 (Functional)           (None, 8, 8, 512)         14714688  
_________________________________________________________________
flatten (Flatten)            (None, 32768)             0         
_________________________________________________________________
dense (Dense)                (None, 16)                524304    
_________________________________________________________________
dense_1 (Dense)              (None, 256)               4352      
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 15,244,372
Trainable params: 529,684
Non-trainable params: 14,714,688
_________________________________________________________________
